# Host: localhost  (Version: 5.5.47)
# Date: 2022-09-25 19:59:54
# Generator: MySQL-Front 5.3  (Build 4.234)

/*!40101 SET NAMES utf8 */;

#
# Structure for table "admin"
#

DROP TABLE IF EXISTS `admin`;
CREATE TABLE `admin` (
  `account` char(16) NOT NULL,
  `password` char(16) DEFAULT NULL,
  `name` char(16) DEFAULT NULL,
  PRIMARY KEY (`account`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

#
# Data for table "admin"
#

INSERT INTO `admin` VALUES ('admin','admin','管理员');

#
# Structure for table "office"
#

DROP TABLE IF EXISTS `office`;
CREATE TABLE `office` (
  `officename` char(16) NOT NULL,
  `description` varchar(255) DEFAULT NULL,
  `doctornum` int(111) DEFAULT NULL,
  PRIMARY KEY (`officename`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

#
# Data for table "office"
#

INSERT INTO `office` VALUES ('不孕不育科','不孕不育作为医院的重点科室，率先引进世界高成功率技术！',1),('中内科','暂无描述',3),('中医妇科',' 汇集全城妇科专家，帮您解决疑难杂症！',0),('儿科泌尿专科','暂无描述',0),('儿科神经内科','暂无描述',0),('内分泌科','暂无描述',4),('口腔科','种植中心、正畸中心、修复等是特色专科。',0),('呼吸内科','暂无描述',0),('外科','暂无描述',3),('心血管内科','暂无描述',0),('新生儿科','暂无描述',0),('眼科','专业眼科，帮助您更好的恢复视力，有一双明亮的眼！',0),('神经内科','暂无描述',0),('骨外科','暂无描述',0);

#
# Structure for table "doctor"
#

DROP TABLE IF EXISTS `doctor`;
CREATE TABLE `doctor` (
  `did` int(11) NOT NULL AUTO_INCREMENT,
  `account` char(16) DEFAULT NULL,
  `password` char(16) DEFAULT NULL,
  `dname` char(16) DEFAULT NULL,
  `fee` int(11) DEFAULT NULL,
  `gender` char(2) DEFAULT NULL,
  `age` int(4) DEFAULT NULL,
  `office` char(16) DEFAULT NULL,
  `career` char(16) DEFAULT NULL,
  `description` varchar(255) DEFAULT NULL,
  `picpath` varchar(64) DEFAULT NULL,
  PRIMARY KEY (`did`),
  KEY `office1` (`office`),
  CONSTRAINT `office1` FOREIGN KEY (`office`) REFERENCES `office` (`officename`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=12 DEFAULT CHARSET=utf8;

#
# Data for table "doctor"
#

INSERT INTO `doctor` VALUES (1,'00001','654321','邱伟华',100,'男',30,'不孕不育科','主任医师','上海交通大学医学院附属瑞金医院','/mavenHospital/images/docpic/1.png'),(2,'00002','123456','汤正义',11,'女',24,'中内科','主任医师','上海交通大学医学院附属瑞金医院','/mavenHospital/images/docpic/2.png'),(3,'00003','123456','吴生元',150,'男',65,'中内科','中医内科专家','上海交通大学医学院附属瑞金医院','/mavenHospital/images/docpic/3.png'),(4,'00004','123456','钟南山',150,'男',51,'中内科','中医内科专家','上海交通大学医学院附属瑞金医院','/mavenHospital/images/docpic/4.png'),(5,'00005','123456','纪立农',100,'男',45,'内分泌科','内分泌科主任','上海交通大学医学院附属瑞金医院','/mavenHospital/images/docpic/5.png'),(6,'00006','123456','邢小平',100,'女',45,'内分泌科','内分泌科专家','上海交通大学医学院附属瑞金医院','/mavenHospital/images/docpic/6.png'),(7,'00007','123456','杨宗于',150,'女',40,'内分泌科','内分泌科副主任','上海交通大学医学院附属瑞金医院','/mavenHospital/images/docpic/7.png'),(8,'00008','123456','吴问汉',150,'男',35,'外科','外科主任','上海交通大学医学院附属瑞金医院','/mavenHospital/images/docpic/8.png'),(9,'00009','123456','朱小文',123,'女',34,'外科','专家','湖南中医药大学','/mavenHospital/images/docpic/9.png'),(10,'00012','123456','傅慎行',56,'男',34,'外科','主任医师','我们来玩个玩个游戏吧','/mavenHospital/images/docpic/10.png'),(11,'00013','123456','康小羽',54,'女',33,'内分泌科','主任医师','既美丽有大方，能力强','/mavenHospital/images/docpic/11.png');

#
# Structure for table "patient"
#

DROP TABLE IF EXISTS `patient`;
CREATE TABLE `patient` (
  `pid` int(11) NOT NULL AUTO_INCREMENT,
  `account` char(16) DEFAULT NULL,
  `email` char(32) DEFAULT NULL,
  `password` char(32) DEFAULT NULL,
  `name` char(11) DEFAULT NULL,
  `integity` tinyint(4) DEFAULT NULL,
  PRIMARY KEY (`pid`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8;

#
# Data for table "patient"
#

INSERT INTO `patient` VALUES (1,'123','1509438463@qq.com','1234','Li',100),(2,'222','llf1234@qq.com','222','LiLian',100),(3,'333','1603656163@qq.com','333','er',100),(4,'890','379840451@qq.com','890','FFL',100);

#
# Structure for table "record"
#

DROP TABLE IF EXISTS `record`;
CREATE TABLE `record` (
  `rid` int(11) NOT NULL AUTO_INCREMENT,
  `pid` int(11) DEFAULT NULL,
  `wid` int(11) DEFAULT NULL,
  `did` int(11) DEFAULT NULL,
  `serialnumber` int(11) DEFAULT NULL,
  `visitdate` date DEFAULT NULL,
  `visittime` char(8) DEFAULT NULL,
  `ordertime` datetime DEFAULT NULL,
  `state` char(8) DEFAULT NULL,
  PRIMARY KEY (`rid`),
  KEY `did` (`wid`),
  KEY `pid` (`pid`)
) ENGINE=InnoDB AUTO_INCREMENT=31 DEFAULT CHARSET=utf8;

#
# Data for table "record"
#

INSERT INTO `record` VALUES (15,1,11,1,2,'2021-01-01','8:54','2020-12-30 10:20:29','成功'),(16,1,6,1,11,'2021-01-05','17:0','2020-12-30 10:28:17','成功'),(17,1,111,8,8,'2021-01-02','11:18','2020-12-30 10:51:25','成功'),(18,1,81,6,8,'2021-01-01','11:18','2020-12-30 10:54:21','成功'),(19,1,69,5,10,'2021-01-02','12:6','2020-12-30 10:57:59','成功'),(20,1,1,1,1,'2021-01-03','8:30','2020-12-30 11:04:49','成功'),(21,1,3,1,9,'2021-01-04','11:42','2020-12-30 11:07:14','成功'),(22,2,3,1,1,'2021-01-04','8:30','2020-12-31 16:59:14','爽约'),(23,2,6,1,1,'2021-01-05','13:30','2020-12-30 17:08:50','完成'),(24,4,99,8,7,'2021-01-03','10:54','2020-12-30 17:38:53','成功'),(25,1,37,3,7,'2020-12-31','10:54','2020-12-30 21:14:30','成功'),(26,1,9,1,10,'2020-12-31','11:3','2020-12-30 21:14:56','成功'),(27,1,7,1,8,'2021-01-06','11:18','2020-12-31 11:34:06','成功'),(28,1,7,1,7,'2021-01-06','11:6','2020-12-31 11:34:46','成功'),(29,1,141,11,3,'2021-01-03','9:18','2020-12-31 11:38:48','成功'),(30,1,105,8,6,'2021-01-06','10:30','2020-12-31 16:32:14','成功'),(31,1,143,11,1,'2022-09-26','8:30','2022-09-25 19:35:48','成功'),(32,1,17,2,1,'2022-09-26','8:30','2022-09-25 19:37:35','成功'),(33,1,17,2,2,'2022-09-26','8:56','2022-09-25 19:37:49','成功'),(34,1,19,2,3,'2022-09-27','9:18','2022-09-25 19:38:04','成功'),(35,1,19,2,4,'2022-09-27','9:48','2022-09-25 19:38:17','成功');

#
# Structure for table "workday"
#

DROP TABLE IF EXISTS `workday`;
CREATE TABLE `workday` (
  `wid` int(11) NOT NULL AUTO_INCREMENT,
  `did` int(11) DEFAULT NULL,
  `worktime` char(4) DEFAULT NULL,
  `ampm` char(4) DEFAULT NULL,
  `nsnum` int(11) DEFAULT NULL,
  `state` char(8) DEFAULT NULL,
  PRIMARY KEY (`wid`),
  KEY `did1` (`did`)
) ENGINE=InnoDB AUTO_INCREMENT=169 DEFAULT CHARSET=utf8;

#
# Data for table "workday"
#

INSERT INTO `workday` VALUES (1,1,'0','上午',10,'预约'),(2,1,'0','下午',0,'停诊'),(3,1,'1','上午',1,'预约'),(4,1,'1','下午',0,'停诊'),(5,1,'2','上午',0,'停诊'),(6,1,'2','下午',0,'预约'),(7,1,'3','上午',8,'预约'),(8,1,'3','下午',0,'停诊'),(9,1,'4','上午',13,'预约'),(10,1,'4','下午',7,'预约'),(11,1,'5','上午',10,'预约'),(12,1,'5','下午',0,'停诊'),(13,1,'6','上午',0,'停诊'),(14,1,'6','下午',12,'预约'),(15,2,'0','上午',10,'预约'),(16,2,'0','下午',0,'停诊'),(17,2,'1','上午',8,'预约'),(18,2,'1','下午',0,'停诊'),(19,2,'2','上午',8,'预约'),(20,2,'2','下午',0,'停诊'),(21,2,'3','上午',10,'预约'),(22,2,'3','下午',0,'停诊'),(23,2,'4','上午',10,'预约'),(24,2,'4','下午',0,'停诊'),(25,2,'5','上午',10,'预约'),(26,2,'5','下午',0,'停诊'),(27,2,'6','上午',10,'预约'),(28,2,'6','下午',0,'停诊'),(29,3,'0','上午',10,'预约'),(30,3,'0','下午',0,'停诊'),(31,3,'1','上午',10,'预约'),(32,3,'1','下午',0,'停诊'),(33,3,'2','上午',10,'预约'),(34,3,'2','下午',0,'停诊'),(35,3,'3','上午',10,'预约'),(36,3,'3','下午',0,'停诊'),(37,3,'4','上午',9,'预约'),(38,3,'4','下午',0,'停诊'),(39,3,'5','上午',10,'预约'),(40,3,'5','下午',0,'停诊'),(41,3,'6','上午',10,'预约'),(42,3,'6','下午',0,'停诊'),(43,4,'0','上午',10,'预约'),(44,4,'0','下午',0,'停诊'),(45,4,'1','上午',10,'预约'),(46,4,'1','下午',0,'停诊'),(47,4,'2','上午',10,'预约'),(48,4,'2','下午',0,'停诊'),(49,4,'3','上午',10,'预约'),(50,4,'3','下午',0,'停诊'),(51,4,'4','上午',10,'预约'),(52,4,'4','下午',0,'停诊'),(53,4,'5','上午',10,'预约'),(54,4,'5','下午',0,'停诊'),(55,4,'6','上午',10,'预约'),(56,4,'6','下午',0,'停诊'),(57,5,'0','上午',10,'预约'),(58,5,'0','下午',0,'停诊'),(59,5,'1','上午',10,'预约'),(60,5,'1','下午',0,'停诊'),(61,5,'2','上午',10,'预约'),(62,5,'2','下午',0,'停诊'),(63,5,'3','上午',10,'预约'),(64,5,'3','下午',0,'停诊'),(65,5,'4','上午',10,'预约'),(66,5,'4','下午',0,'停诊'),(67,5,'5','上午',10,'预约'),(68,5,'5','下午',0,'停诊'),(69,5,'6','上午',9,'预约'),(70,5,'6','下午',0,'停诊'),(71,6,'0','上午',10,'预约'),(72,6,'0','下午',0,'停诊'),(73,6,'1','上午',10,'预约'),(74,6,'1','下午',0,'停诊'),(75,6,'2','上午',10,'预约'),(76,6,'2','下午',0,'停诊'),(77,6,'3','上午',10,'预约'),(78,6,'3','下午',0,'停诊'),(79,6,'4','上午',10,'预约'),(80,6,'4','下午',0,'停诊'),(81,6,'5','上午',10,'预约'),(82,6,'5','下午',0,'停诊'),(83,6,'6','上午',10,'预约'),(84,6,'6','下午',0,'停诊'),(85,7,'0','上午',10,'预约'),(86,7,'0','下午',0,'停诊'),(87,7,'1','上午',10,'预约'),(88,7,'1','下午',0,'停诊'),(89,7,'2','上午',10,'预约'),(90,7,'2','下午',0,'停诊'),(91,7,'3','上午',10,'预约'),(92,7,'3','下午',0,'停诊'),(93,7,'4','上午',10,'预约'),(94,7,'4','下午',0,'停诊'),(95,7,'5','上午',10,'预约'),(96,7,'5','下午',0,'停诊'),(97,7,'6','上午',10,'预约'),(98,7,'6','下午',0,'停诊'),(99,8,'0','上午',9,'预约'),(100,8,'0','下午',0,'停诊'),(101,8,'1','上午',10,'预约'),(102,8,'1','下午',0,'停诊'),(103,8,'2','上午',10,'预约'),(104,8,'2','下午',0,'停诊'),(105,8,'3','上午',9,'预约'),(106,8,'3','下午',0,'停诊'),(107,8,'4','上午',10,'预约'),(108,8,'4','下午',0,'停诊'),(109,8,'5','上午',10,'预约'),(110,8,'5','下午',0,'停诊'),(111,8,'6','上午',10,'预约'),(112,8,'6','下午',0,'停诊'),(113,9,'0','上午',10,'预约'),(114,9,'0','下午',0,'停诊'),(115,9,'1','上午',10,'预约'),(116,9,'1','下午',0,'停诊'),(117,9,'2','上午',10,'预约'),(118,9,'2','下午',0,'停诊'),(119,9,'3','上午',10,'预约'),(120,9,'3','下午',0,'停诊'),(121,9,'4','上午',10,'预约'),(122,9,'4','下午',0,'停诊'),(123,9,'5','上午',10,'预约'),(124,9,'5','下午',0,'停诊'),(125,9,'6','上午',10,'预约'),(126,9,'6','下午',0,'停诊'),(127,10,'0','上午',10,'预约'),(128,10,'0','下午',0,'停诊'),(129,10,'1','上午',10,'预约'),(130,10,'1','下午',0,'停诊'),(131,10,'2','上午',10,'预约'),(132,10,'2','下午',0,'停诊'),(133,10,'3','上午',10,'预约'),(134,10,'3','下午',0,'停诊'),(135,10,'4','上午',10,'预约'),(136,10,'4','下午',0,'停诊'),(137,10,'5','上午',10,'预约'),(138,10,'5','下午',0,'停诊'),(139,10,'6','上午',10,'预约'),(140,10,'6','下午',0,'停诊'),(141,11,'0','上午',9,'预约'),(142,11,'0','下午',0,'停诊'),(143,11,'1','上午',9,'预约'),(144,11,'1','下午',0,'停诊'),(145,11,'2','上午',10,'预约'),(146,11,'2','下午',0,'停诊'),(147,11,'3','上午',10,'预约'),(148,11,'3','下午',0,'停诊'),(149,11,'4','上午',10,'预约'),(150,11,'4','下午',0,'停诊'),(151,11,'5','上午',10,'预约'),(152,11,'5','下午',0,'停诊'),(153,11,'6','上午',10,'预约'),(154,11,'6','下午',0,'停诊'),(155,12,'0','上午',10,'预约'),(156,12,'0','下午',0,'停诊'),(157,12,'1','上午',10,'预约'),(158,12,'1','下午',0,'停诊'),(159,12,'2','上午',10,'预约'),(160,12,'2','下午',0,'停诊'),(161,12,'3','上午',10,'预约'),(162,12,'3','下午',0,'停诊'),(163,12,'4','上午',10,'预约'),(164,12,'4','下午',0,'停诊'),(165,12,'5','上午',10,'预约'),(166,12,'5','下午',0,'停诊'),(167,12,'6','上午',10,'预约'),(168,12,'6','下午',0,'停诊');
